In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [4]:
dataframe = pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])

In [5]:
dataframe

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
dataframe['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [7]:
type(dataframe['X'])

pandas.core.series.Series

In [8]:
type(dataframe)

pandas.core.frame.DataFrame

In [9]:
dataframe[['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [10]:
dataframe["NEW"] = dataframe['Y'] + dataframe["Z"]

In [11]:
dataframe

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [12]:
dataframe.drop('NEW',axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
dataframe

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [14]:
dataframe.drop('NEW',axis = 1,inplace = True)

In [15]:
dataframe

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
dataframe.drop("B")

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Both rows and columns are series

#### COLUMNS

In [17]:
dataframe["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [18]:
dataframe['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [19]:
dataframe['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [20]:
dataframe['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

#### ROWS

In [21]:
dataframe.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [22]:
dataframe.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [23]:
dataframe.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [24]:
dataframe.loc['D']

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [25]:
dataframe.loc['E']

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

In [26]:
dataframe.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [27]:
dataframe.iloc[1]

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [28]:
dataframe.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [29]:
dataframe.iloc[3]

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [30]:
dataframe.iloc[4]

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

In [31]:
dataframe.loc['A','W']

2.706849839399938

In [32]:
dataframe.loc['A','X']

0.6281327087844596

In [33]:
dataframe.loc['A','Y']

0.9079694464765431

In [34]:
dataframe.loc['A','Z']

0.5038257538223936

In [35]:
dataframe.loc['B','W']

0.6511179479432686

In [36]:
dataframe.loc['B','X']

-0.31931804459303326

In [37]:
dataframe.loc['B','Y']

-0.8480769834036315

In [38]:
dataframe.loc['B','Z']

0.6059653494949336

In [39]:
dataframe.loc['C','W']

-2.018168244037392

In [40]:
dataframe.loc['C','W']

-2.018168244037392

In [41]:
dataframe.loc['C','W']

-2.018168244037392

In [42]:
dataframe.loc['C','W']

-2.018168244037392

In [43]:
dataframe.loc['D','W']

0.18869530944922425

In [44]:
dataframe.loc['D','X']

-0.758872056210466

In [45]:
dataframe.loc['D','Y']

-0.9332372163009188

In [46]:
dataframe.loc['D','Z']

0.9550565092637361

In [47]:
dataframe.loc[['C','D'],['X','Z']]

          X         Z
C  0.740122 -0.589001
D -0.758872  0.955057

In [48]:
dataframe.loc[['B','C','D'],['X','Y','Z']]

          X         Y         Z
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057

In [49]:
dataframe

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Boolean condtion

In [50]:
dataframe > 1

       W      X      Y      Z
A   True  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False   True   True  False

In [51]:
bool_dataframe = dataframe > 1

In [52]:
dataframe[bool_dataframe]

         W         X         Y   Z
A  2.70685       NaN       NaN NaN
B      NaN       NaN       NaN NaN
C      NaN       NaN       NaN NaN
D      NaN       NaN       NaN NaN
E      NaN  1.978757  2.605967 NaN

In [53]:
dataframe[dataframe > 1]

         W         X         Y   Z
A  2.70685       NaN       NaN NaN
B      NaN       NaN       NaN NaN
C      NaN       NaN       NaN NaN
D      NaN       NaN       NaN NaN
E      NaN  1.978757  2.605967 NaN

In [54]:
dataframe[dataframe > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
dataframe > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [56]:
dataframe[dataframe['X'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [57]:
dataframe[dataframe['X'] > 0]['W']

A    2.706850
C   -2.018168
E    0.190794
Name: W, dtype: float64

In [58]:
dataframe[dataframe['X'] > 0][['W','Z']]

          W         Z
A  2.706850  0.503826
C -2.018168 -0.589001
E  0.190794  0.683509

In [59]:
# Breaking down the above line
boolser = dataframe['X'] > 0
result = dataframe[boolser]
mycols = ['W','Z']
result[mycols]

          W         Z
A  2.706850  0.503826
C -2.018168 -0.589001
E  0.190794  0.683509

In [60]:
dataframe[dataframe['Z'] < 0][['X','Y']]

          X         Y
C  0.740122  0.528813

In [61]:
dataframe[(dataframe['X'] > 0) & (dataframe['W'] > 1)]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [62]:
dataframe[(dataframe['X'] > 0) | (dataframe['W'] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [63]:
dataframe['X'] > 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [64]:
dataframe['W'] > 1

A     True
B    False
C    False
D    False
E    False
Name: W, dtype: bool

In [65]:
(dataframe['X'] > 0) & (dataframe['W'] > 1)

A     True
B    False
C    False
D    False
E    False
dtype: bool

In [66]:
(dataframe['X'] > 0) | (dataframe['W'] > 1)

A     True
B    False
C     True
D    False
E     True
dtype: bool

In [67]:
# Resetting the index 
dataframe.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [68]:
dataframe

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [69]:
n_id = "MH UP MP AP TN".split()

In [70]:
n_id

['MH', 'UP', 'MP', 'AP', 'TN']

In [71]:
# Adding column
dataframe["States"] = n_id

In [72]:
dataframe

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     MH
B  0.651118 -0.319318 -0.848077  0.605965     UP
C -2.018168  0.740122  0.528813 -0.589001     MP
D  0.188695 -0.758872 -0.933237  0.955057     AP
E  0.190794  1.978757  2.605967  0.683509     TN

In [73]:
# setting states column as index
dataframe.set_index("States")

               W         X         Y         Z
States
MH      2.706850  0.628133  0.907969  0.503826
UP      0.651118 -0.319318 -0.848077  0.605965
MP     -2.018168  0.740122  0.528813 -0.589001
AP      0.188695 -0.758872 -0.933237  0.955057
TN      0.190794  1.978757  2.605967  0.683509

In [74]:
dataframe

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     MH
B  0.651118 -0.319318 -0.848077  0.605965     UP
C -2.018168  0.740122  0.528813 -0.589001     MP
D  0.188695 -0.758872 -0.933237  0.955057     AP
E  0.190794  1.978757  2.605967  0.683509     TN

#### Multi-Indexing and Index Hierarchy

In [75]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [76]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [77]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [78]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [79]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [80]:
df.loc['G1'].loc[2]

A   -1.706086
B   -1.159119
Name: 2, dtype: float64

In [81]:
df.loc['G1'].loc[3]

A   -0.134841
B    0.390528
Name: 3, dtype: float64

In [82]:
df.loc['G2']

          A         B
1  0.166905  0.184502
2  0.807706  0.072960
3  0.638787  0.329646

In [83]:
df.loc['G2'].loc[1]

A    0.166905
B    0.184502
Name: 1, dtype: float64

In [84]:
df.loc['G2'].loc[2]

A    0.807706
B    0.072960
Name: 2, dtype: float64

In [85]:
df.loc['G2'].loc[3]

A    0.638787
B    0.329646
Name: 3, dtype: float64

In [86]:
df.index.names

FrozenList([None, None])

In [87]:
df.index.names = ['GROUPS',"LEVELS"]

In [88]:
df

                      A         B
GROUPS LEVELS
G1     1       0.302665  1.693723
       2      -1.706086 -1.159119
       3      -0.134841  0.390528
G2     1       0.166905  0.184502
       2       0.807706  0.072960
       3       0.638787  0.329646

In [89]:
df.loc["G2"]

               A         B
LEVELS
1       0.166905  0.184502
2       0.807706  0.072960
3       0.638787  0.329646

In [90]:
df.loc["G2"].loc[2]['B']

0.07295967531703869

In [91]:
df.loc["G1"]

               A         B
LEVELS
1       0.302665  1.693723
2      -1.706086 -1.159119
3      -0.134841  0.390528

In [92]:
df.loc["G1"].loc[3]['A']

-0.13484072060601238

In [93]:
# CrossSection method xs
df.xs(1,level = "LEVELS")

               A         B
GROUPS
G1      0.302665  1.693723
G2      0.166905  0.184502

In [94]:
df.xs(2,level = "LEVELS")

               A         B
GROUPS
G1     -1.706086 -1.159119
G2      0.807706  0.072960

In [95]:
df.xs(3,level = "LEVELS")

               A         B
GROUPS
G1     -0.134841  0.390528
G2      0.638787  0.329646

In [96]:
df.loc[["G1","G2"]]["A"]

GROUPS  LEVELS
G1      1         0.302665
        2        -1.706086
        3        -0.134841
G2      1         0.166905
        2         0.807706
        3         0.638787
Name: A, dtype: float64

In [97]:
df.loc[["G1","G2"]]["B"]

GROUPS  LEVELS
G1      1         1.693723
        2        -1.159119
        3         0.390528
G2      1         0.184502
        2         0.072960
        3         0.329646
Name: B, dtype: float64